benchmark_database.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /database
Document Length:        45 bytes

Concurrency Level:      100
Time taken for tests:   0.361 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      245000 bytes
HTML transferred:       45000 bytes
Requests per second:    2766.25 [#/sec] (mean)
Time per request:       36.150 [ms] (mean)
Time per request:       0.361 [ms] (mean, across all concurrent requests)
Transfer rate:          661.85 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       2
Processing:    20   33   3.3     34      42
Waiting:       20   30   3.1     31      35
Total:         20   33   3.2     34      42

Percentage of the requests served within a certain time (ms)
  50%     34
  66%     35
  75%     35
  80%     35
  90%     36
  95%     38
  98%     41
  99%     41
 100%     42 (longest request)