benchmark_slow.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /slow
Document Length:        38 bytes

Concurrency Level:      100
Time taken for tests:   13.310 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      238000 bytes
HTML transferred:       38000 bytes
Requests per second:    75.13 [#/sec] (mean)
Time per request:       1330.996 [ms] (mean)
Time per request:       13.310 [ms] (mean, across all concurrent requests)
Transfer rate:          17.46 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       2
Processing:  1000 1178 491.3   1015    2654
Waiting:     1000 1175 490.5   1012    2653
Total:       1000 1178 491.6   1015    2654

Percentage of the requests served within a certain time (ms)
  50%   1015
  66%   1016
  75%   1018
  80%   1019
  90%   2642
  95%   2653
  98%   2653
  99%   2653
 100%   2654 (longest request)